import { UnitType } from "../domain";
import { db } from "./_db";






//===






db.today = "2022-02-22";






/** 50П */
export let R50 = db.Unit.add(
	null, 
	UnitType.Regiment,
	["50П", "50 полк", "50 полк НГУ"],
	["50П", "50 полку", "50 полку НГУ"],
);





/** 1СБ 50П */
export let R50_RB1 = db.Unit.add(

	R50,	
	UnitType.Battalion,

	[
		"1СБ",
		"1 стрілецький батальон",
		"1 стрілецький батальон (з охорони та оборони важливих державний об'єктів)",
	],

	[
		"1СБ",
		"1 стрілецького батальону",
		"1 стрілецького батальону (з охорони та оборони важливих державний об'єктів)",
	],

);



/** 2СВ 1СБ 50П */
export let R50_RB1_RP2 = db.Unit.add(
	R50_RB1,
	UnitType.Platoon,

	[
		"2СВ",
		"2 стрілецький взвод",
		"2 стрілецький взвод (з охорони та оборони важливих державний об'єктів)"
	],

	[
		"2СВ",
		"2 стрілецького взводу",
		"2 стрілецького взводу (з охорони та оборони важливих державний об'єктів)"
	],
);


/** 1 відд. 2СВ 1СБ 50П */
export let R50_RB1_RP2_S1 = db.Unit.add(
	R50_RB1_RP2,
	UnitType.Squad,
	["1 відд.", "1 відділення", "1 відділення"],
	["1 відд.", "1 відділення", "1 відділення"],
);


/** 2 відд. 2СВ 1СБ 50П */
export let R50_RB1_RP2_S2 = db.Unit.add(
	R50_RB1_RP2,
	UnitType.Squad,
	["2 відд.", "2 відділення", "2 відділення"],
	["2 відд.", "2 відділення", "2 відділення"],
);


/** 3 відд. 2СВ 1СБ 50П */
export let R50_RB1_RP2_S3 = db.Unit.add(
	R50_RB1_RP2,
	UnitType.Squad,
	["3 відд.", "3 відділення", "3 відділення"],
	["3 відд.", "3 відділення", "3 відділення"],
);






//===






db.today = "2022-02-22";






db.Unit_Name.add(
	R50_RB1_RP2,
	[
		"СВ ООВДО №66",
		"стрілецький взвод з ООВДО №66",
		"стрілецький взвод з охорони та оборони важливого державного об'єкту №66"
	],
	[
		"СВ ООВДО №66",
		"стрілецького взводу з ООВДО №66",
		"стрілецького взводу з охорони та оборони важливого державного об'єкту №66"
	]
)