import { db } from "./_db";
import * as d from "./data00";




export * from "./data00";





export let R50 = db.Unit.addRegiment(
	null,
	[
		["50П"],
		["50 полк"],
		["50 полк НГУ"]
	],
);



export let R50_RB1 = db.Unit.addBattalion(
	null,
	[
		["1СБ", "1СБ 50П"],
		["1 стрілецький батальон", "1 стрілецький батальон 50 полку"],
		[
			"1 стрілецький батальон (з охорони та оборони важливих державний об'єктів)",
			"1 стрілецький батальон (з охорони та оборони важливих державний об'єктів) 50 полку НГУ",
		]
	],
);



export let R50_RB1_RP2 = db.Unit.addPlatoon(
	R50_RB1,
	[
		["2СВ", null, "2СВ 1СБ", "2СВ 1СБ 50П"],
		[
			"2 стрілецький взвод",
			null,
			"2 стрілецький взвод 1-го стрілецького батальону",
			"2 стрілецький взвод 1-го стрілецького батальону 50 полку",
		],
		[
			"2 стрілецький взвод (з охорони та оборони важливих державний об'єктів)",
			null,
			"2 стрілецький взвод (з охорони та оборони важливих державний об'єктів) 1 стрілецького батальону (з охорони та оборони важливих державний об'єктів)",
			"2 стрілецький взвод (з охорони та оборони важливих державний об'єктів) 1 стрілецького батальону (з охорони та оборони важливих державний об'єктів) 50 полку НГУ",
		]
	],
);



export let R50_RB1_RP2_S1 = db.Unit.addSquad(
	R50_RB1_RP2,
	[
		["1 відд.", "2СВ", null, "2СВ 1СБ", "2СВ 1СБ 50П"],
		[
			"2 стрілецький взвод",
			"2 стрілецький взвод",
			null,
			"2 стрілецький взвод 1-го стрілецького батальону",
			"2 стрілецький взвод 1-го стрілецького батальону 50 полку",
		],
		[
			"2 стрілецького взводу (з охорони та оборони важливих державний об'єктів)",
			"2 стрілецького взводу (з охорони та оборони важливих державний об'єктів)",
			null,
			"2 стрілецького взводу (з охорони та оборони важливих державний об'єктів) 1 стрілецького батальону (з охорони та оборони важливих державний об'єктів)",
			"2 стрілецького взводу (з охорони та оборони важливих державний об'єктів) 1 стрілецького батальону (з охорони та оборони важливих державний об'єктів) 50 полку НГУ",
		]
	],
);
